emsesp/EMS-ESP32/src/core/system.cpp
    tx_mode_              = settings.tx_mode;
    syslog_enabled_       = settings.syslog_enabled;
    syslog_level_         = settings.syslog_level;
    syslog_mark_interval_ = settings.syslog_mark_interval;
    syslog_host_          = settings.syslog_host;
    syslog_port_          = settings.syslog_port;

    fahrenheit_     = settings.fahrenheit;
    bool_format_    = settings.bool_format;
    bool_dashboard_ = settings.bool_dashboard;
    enum_format_    = settings.enum_format;
    readonly_mode_  = settings.readonly_mode;

    phy_type_       = settings.phy_type;
    eth_power_      = settings.eth_power;
    eth_phy_addr_   = settings.eth_phy_addr;
    eth_clock_mode_ = settings.eth_clock_mode;

    locale_         = settings.locale;
    developer_mode_ = settings.developer_mode;
}

// Starts up the UART Serial bridge
void System::start() {
    get_partition_info(); // get the partition info

#ifndef EMSESP_STANDALONE
    // disable bluetooth module
    // periph_module_disable(PERIPH_BT_MODULE);
    if (low_clock_) {
#if CONFIG_IDF_TARGET_ESP32C3
        setCpuFrequencyMhz(80);
#else
        setCpuFrequencyMhz(160);
#endif
    }

    // get current memory values
    fstotal_ = LittleFS.totalBytes() / 1024; // read only once, it takes 500 ms to read
    appused_ = ESP.getSketchSize() / 1024;
    appfree_ = esp_ota_get_running_partition()->size / 1024 - appused_;
    refreshHeapMem(); // refresh free heap and max alloc heap
#if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32S2
#if ESP_IDF_VERSION_MAJOR < 5
    temp_sensor_config_t temp_sensor = TSENS_CONFIG_DEFAULT();
    temp_sensor_get_config(&temp_sensor);
    temp_sensor.dac_offset = TSENS_DAC_DEFAULT; // DEFAULT: range:-10℃ ~  80℃, error < 1℃.
    temp_sensor_set_config(temp_sensor);
    temp_sensor_start();
    temp_sensor_read_celsius(&temperature_);
#else
    temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(-10, 80);
    temperature_sensor_install(&temp_sensor_config, &temperature_handle_);
    temperature_sensor_enable(temperature_handle_);
    temperature_sensor_get_celsius(temperature_handle_, &temperature_);
#endif
#endif
#endif

    EMSESP::esp32React.getNetworkSettingsService()->read([&](NetworkSettings & networkSettings) {
        hostname(networkSettings.hostname.c_str()); // sets the hostname
    });

    commands_init(); // console & api commands
    led_init();      // init LED
    button_init();   // button
    network_init();  // network
    uart_init();     // start UART
    syslog_init();   // start syslog
}

// button single click
void System::button_OnClick(PButton & b) {
    LOG_NOTICE("Button pressed - single click");

#if defined(EMSESP_TEST)
#ifndef EMSESP_STANDALONE
    // show filesystem
    Test::listDir(LittleFS, "/", 3);
#endif
#endif
}

// button double click
void System::button_OnDblClick(PButton & b) {
    LOG_NOTICE("Button pressed - double click - wifi reconnect to AP");
    // set AP mode to always so will join AP if wifi ssid fails to connect
    EMSESP::esp32React.getAPSettingsService()->update([&](APSettings & apSettings) {
        apSettings.provisionMode = AP_MODE_ALWAYS;
        return StateUpdateResult::CHANGED;
    });
    // remove SSID from network settings
    EMSESP::esp32React.getNetworkSettingsService()->update([&](NetworkSettings & networkSettings) {
        networkSettings.ssid = "";
        return StateUpdateResult::CHANGED;
    });
    EMSESP::esp32React.getNetworkSettingsService()->callUpdateHandlers(); // in case we've changed ssid or password
}

// LED flash timer interrupt service routine
void IRAM_ATTR System::led_flash_timer_isr() {
    led_flash_state_ = !led_flash_state_; // Toggle LED state

    if (led_flash_state_) {
        led_flash_type_ ? EMSESP_RGB_WRITE(led_flash_gpio_, 255, 255, 255) : digitalWrite(led_flash_gpio_, LED_ON); // white, on
    } else {
        led_flash_type_ ? EMSESP_RGB_WRITE(led_flash_gpio_, 0, 0, 0) : digitalWrite(led_flash_gpio_, !LED_ON); // off
    }

    // Increment flash count, 2 toggles = 1 flash cycle. And stop after 5 seconds (5000ms/100ms = 50)
    if (led_flash_count_++ >= 50) {
        stop_led_flash();
    }
}

// Start the LED flash timer
void System::start_led_flash() {
#ifndef EMSESP_STANDALONE
    // Don't start if already running
    if (led_flash_timer_ != nullptr) {
        return;
    }

    // Get LED settings
    EMSESP::webSettingsService.read([&](WebSettings & settings) {
        led_flash_type_ = settings.led_type;
        led_flash_gpio_ = settings.led_gpio;
    });

    // Reset counter and state
    led_flash_count_ = 0;
    led_flash_state_ = false;

    led_flash_timer_ = timerBegin(0, 80, true);                         // Create and start timer (prescaler 80 for 1us tick, counting up)
    timerAttachInterrupt(led_flash_timer_, &led_flash_timer_isr, true); // Attach interrupt handler
    timerAlarmWrite(led_flash_timer_, 100000, true);                    // Set alarm to trigger every 100ms
    timerAlarmEnable(led_flash_timer_);                                 // Enable the alarm
#endif
}

// Stop the LED flash timer
void System::stop_led_flash() {
#ifndef EMSESP_STANDALONE
    if (led_flash_timer_ != nullptr) {
        // Stop and detach timer
        timerAlarmDisable(led_flash_timer_);
        timerDetachInterrupt(led_flash_timer_);
        timerEnd(led_flash_timer_);
        led_flash_timer_ = nullptr;
        led_flash_type_ ? EMSESP_RGB_WRITE(led_flash_gpio_, 0, 0, 0) : digitalWrite(led_flash_gpio_, !LED_ON); // Turn off LED
    }
#endif
}

// button long press
void System::button_OnLongPress(PButton & b) {
    LOG_NOTICE("Button pressed - long press - perform factory reset");
    start_led_flash(); // Start the non-blocking LED flash timer for 5 seconds
#ifndef EMSESP_STANDALONE
    System::command_format(nullptr, 0);
#endif
}

// button indefinite press - boots to boot partition
void System::button_OnVLongPress(PButton & b) {
    LOG_NOTICE("Button pressed - very long press - restart from factory/boot partition");
    EMSESP::system_.system_restart("boot");
}

// push button
void System::button_init() {
#ifndef EMSESP_STANDALONE
    if (!myPButton_.init(pbutton_gpio_, HIGH)) {
        LOG_WARNING("Multi-functional button not detected");
        return;
    }
    LOG_DEBUG("Multi-functional button enabled");

