emsesp/EMS-ESP32/src/core/system.cpp
    return true;
}

// format command - factory reset, removing all config files
bool System::command_format(const char * value, const int8_t id) {
#ifndef EMSESP_STANDALONE
    if (LittleFS.format()) {
        LOG_INFO("Filesystem formatted successfully. All config files removed.");
    } else {
        LOG_ERROR("Format failed");
    }
#endif

    // restart will be handled by the main loop
    EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_RESTART_REQUESTED);
    return true;
}

// restart command - perform a hard reset (system reboot)
bool System::command_restart(const char * value, const int8_t id) {
    if (id == 0) {
        // if it has an id then it's a web call and we need to queue the restart
        // default id is -1 when calling /api/system/restart directly for example
        LOG_INFO("Preparing to restart system");
        EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_PENDING_RESTART);
        return true;
    }

    LOG_INFO("Restarting system immediately");
    // restart will be handled by the main loop
    EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_RESTART_REQUESTED);
    return true;
}

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wswitch"

std::string System::reset_reason(uint8_t cpu) const {
#ifndef EMSESP_STANDALONE
    switch (rtc_get_reset_reason(cpu)) {
    case 1:
        return ("Power on reset");
    // case 2 :reset pin not on esp32
    case 3:
        return ("Software reset");
    case 4: // not on S2, C3
        return ("Legacy watch dog reset");
    case 5:
        return ("Deep sleep reset");
    case 6: // not on S2, C3
        return ("Reset by SDIO");
    case 7:
        return ("Timer group0 watch dog reset");
    case 8:
        return ("Timer group1 watch dog reset");
    case 9:
        return ("RTC watch dog reset");
    case 10:
        return ("Intrusion reset CPU");
    case 11:
        return ("Timer group reset CPU");
    case 12:
        return ("Software reset CPU");
    case 13:
        return ("RTC watch dog reset: CPU");
    case 14: // not on S2, C3
        return ("APP CPU reset by PRO CPU");
    case 15:
        return ("Brownout reset");
    case 16:
        return ("RTC watch dog reset: CPU+RTC");
    default:
        break;
    }
#endif
    return "Unknown";
}
#pragma GCC diagnostic pop

// set NTP status
void System::ntp_connected(bool b) {
    if (b != ntp_connected_) {
        if (b) {
            LOG_INFO("NTP connected");
        } else {
            LOG_WARNING("NTP disconnected"); // if turned off report it
        }
    }

    ntp_connected_  = b;
    ntp_last_check_ = b ? uuid::get_uptime_sec() : 0;
}

// get NTP status
bool System::ntp_connected() {
    // timeout 2 hours, ntp sync is normally every hour.
    if ((uuid::get_uptime_sec() - ntp_last_check_ > 7201) && ntp_connected_) {
        ntp_connected(false);
    }

    return ntp_connected_;
}

// see if its a BBQKees Gateway by checking the nvs values
String System::getBBQKeesGatewayDetails(uint8_t detail) {
#ifndef EMSESP_STANDALONE
    /*
    if (!EMSESP::nvs_.isKey("mfg")) {
        return "";
    }

    // mfg can be either "BBQKees" or "BBQKees Electronics"
    auto mfg = EMSESP::nvs_.getString("mfg");
    if (mfg) {
        if (!mfg.startsWith("BBQKees")) {
            return "";
        }
    }

    return "BBQKees Gateway Model " + EMSESP::nvs_.getString("model") + " v" + EMSESP::nvs_.getString("hwrevision") + "/" + EMSESP::nvs_.getString("batch");
*/
    union {
        struct {
            uint32_t no : 4;
            uint32_t month : 4;
            uint32_t year : 8;
            uint32_t rev_minor : 4;
            uint32_t rev_major : 4;
            uint32_t model : 4;
            uint32_t mfg : 4;
        };
        uint32_t reg;
    } gw;
    for (uint8_t reg = 0; reg < 8; reg++) {
        gw.reg = esp_efuse_read_reg(EFUSE_BLK3, reg);
        if (reg == 7 || esp_efuse_read_reg(EFUSE_BLK3, reg + 1) == 0)
            break;
    }
    const char * mfg[]   = {"unknown", "BBQKees Electronics", "", "", "", "", "", ""};
    const char * model[] = {"unknown", "S3", "E32V2", "E32V2.2", "S32", "E32", "", "", ""};
    const char * board[] = {"CUSTOM", "S32S3", "E32V2", "E32V2_2", "S32", "E32", "", "", ""};
    switch (detail) {
    case FUSE_VALUE::MFG:
        return gw.mfg < 2 ? String(mfg[gw.mfg]) : "unknown";
    case FUSE_VALUE::MODEL:
        return gw.model < 6 ? String(model[gw.model]) : "unknown";
    case FUSE_VALUE::BOARD:
        return gw.model < 6 ? String(board[gw.model]) : board_profile_;
    case FUSE_VALUE::REV:
        return String(gw.rev_major) + "." + String(gw.rev_minor);
    case FUSE_VALUE::BATCH:
        return String(2000 + gw.year) + (gw.month < 10 ? "0" : "") + String(gw.month) + String(gw.no);
    case FUSE_VALUE::FUSE:
        return "0x" + String(gw.reg, 16);
    case FUSE_VALUE::ALL:
    default:
        break;
    }
    if (!gw.reg || gw.mfg > 1 || gw.model > 5) {
        return "";
    }
    return String(mfg[gw.mfg]) + " " + String(model[gw.model]) + " rev." + String(gw.rev_major) + "." + String(gw.rev_minor) + "/" + String(2000 + gw.year)
           + (gw.month < 10 ? "0" : "") + String(gw.month) + String(gw.no);
#else
    return "";
#endif
}

// Stream from an URL and send straight to OTA uploader service.
//
// This function needs to be called twice, 1st pass once with a url to persist it, 2nd pass with no arguments to start the upload
// This is to avoid timeouts in callback functions, like calling from a web hook.
bool System::uploadFirmwareURL(const char * url) {
#ifndef EMSESP_STANDALONE
    static String saved_url;

    if (url && strlen(url) > 0) {
        // if the passed URL is "reset" abort the current upload. This is called when an error happens during OTA
        if (strncmp(url, "reset", 5) == 0) {
            LOG_DEBUG("Firmware upload - resetting");
            saved_url.clear();
            return true;
        }

        // given a URL to download from, save it ready for the 2nd pass
        saved_url = url;
        LOG_INFO("Firmware location: %s", saved_url.c_str());
        EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_PENDING_UPLOAD); // we're ready to start the upload
        return true;
    }

    // check we have a valid URL from the 1st pass
    if (saved_url.isEmpty()) {
        LOG_ERROR("Firmware upload failed - invalid URL");
        return false; // error
    }

